
import { CharacterTemplate } from '../types';

// ===========================
// 角色配置 (Characters)
// ===========================
export const CHARACTERS: Record<string, CharacterTemplate> = {
  '训练员': {
    id: '训练员',
    名称: '训练员', 
    性别: '男', 
    isTrainer: true,
    初始标签: ['训练员'],
    通用属性: { 体质: 10, 学识: 10, 魅力: 10, 财富: 10, 心情: 60, 体力: 100, 精力: 100, 爱欲: 10 },
    竞赛属性: { 速度: 0, 耐力: 0, 力量: 0, 毅力: 0, 智慧: 0 }
  },
  '优秀素质': {
    id: '优秀素质',
    名称: '优秀素质',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '配角', '凡人', '老成', '吐槽役'],
    通用属性: { 体质: 12, 学识: 14, 魅力: 12, 财富: 6, 心情: 50, 体力: 80, 精力: 80, 爱欲: 20 },
    竞赛属性: { 速度: 108, 耐力: 99, 力量: 113, 毅力: 100, 智慧: 114 },
    称呼列表: [
        { 判别式: '', 称呼: '训练员' }
    ]
  },
  '东海帝王': {
    id: '东海帝王',
    名称: '东海帝王',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '天才', '热血', '魅力十足', '小祖宗'],
    通用属性: { 体质: 8, 学识: 12, 魅力: 20, 财富: 12, 心情: 80, 体力: 90, 精力: 90, 爱欲: 10 },
    竞赛属性: { 速度: 109, 耐力: 109, 力量: 102, 毅力: 112, 智慧: 118 },
    称呼列表: [
        { 判别式: '', 称呼: '训练员' }
    ]
  },
  '摩耶重炮': {
    id: '摩耶重炮',
    名称: '摩耶重炮',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '天才', '冒失', '幸运', '恋爱脑', '小祖宗'],
    通用属性: { 体质: 16, 学识: 10, 魅力: 16, 财富: 10, 心情: 70, 体力: 90, 精力: 70, 爱欲: 15 },
    竞赛属性: { 速度: 94, 耐力: 130, 力量: 86, 毅力: 123, 智慧: 117 },
    称呼列表: [
        { 判别式: '', 称呼: '训练员' }
    ]
  },
  '米浴': {
    id: '米浴',
    名称: '米浴',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '倒霉', '沉重', '凡人', '小祖宗'], 
    通用属性: { 体质: 6, 学识: 14, 魅力: 10, 财富: 10, 心情: 40, 体力: 80, 精力: 90, 爱欲: 10 },
    竞赛属性: { 速度: 87, 耐力: 143, 力量: 86, 毅力: 125, 智慧: 109 },
    称呼列表: [
        { 判别式: '训练员.性别 == "男"', 称呼: '大哥哥' },
        { 判别式: '训练员.性别 == "女"', 称呼: '大姐姐' }
    ]
  }
};