
import { CharacterTemplate } from '../types';

// ===========================
// 角色配置 (Characters)
// ===========================
export const CHARACTERS: Record<string, CharacterTemplate> = {
  '训练员': {
    id: '训练员',
    名称: '训练员', 
    性别: '男', 
    isTrainer: true,
    初始标签: ['训练员'],
    // 基础属性调整为10
    通用属性: { 体质: 10, 学识: 10, 魅力: 10, 财富: 10, 心情: 60, 体力: 100, 精力: 100, 爱欲: 10 },
    竞赛属性: { 速度: 600, 耐力: 600, 力量: 600, 毅力: 600, 智慧: 600 },
    适性: {
        草地: 'C', 沙地: 'C',
        短距离: 'C', 英里: 'C', 中距离: 'C', 长距离: 'C',
        领头: 'C', 前列: 'C', 居中: 'C', 后追: 'C'
    }
  },
  '优秀素质': {
    id: '优秀素质',
    名称: '优秀素质',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '配角', '凡人', '老成', '吐槽役'],
    通用属性: { 体质: 12, 学识: 14, 魅力: 12, 财富: 6, 心情: 50, 体力: 80, 精力: 80, 爱欲: 20 },
    竞赛属性: { 速度: 108, 耐力: 99, 力量: 113, 毅力: 100, 智慧: 114 },
    适性: {
        草地: 'A', 沙地: 'G',
        短距离: 'G', 英里: 'C', 中距离: 'A', 长距离: 'A',
        领头: 'F', 前列: 'B', 居中: 'A', 后追: 'D'
    },
    称呼列表: [
        { 判别式: '', 称呼: '训练员' } // 默认
    ]
  },
  '东海帝王': {
    id: '东海帝王',
    名称: '东海帝王',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '天才', '热血', '魅力十足', '小祖宗'],
    通用属性: { 体质: 8, 学识: 12, 魅力: 20, 财富: 12, 心情: 80, 体力: 90, 精力: 90, 爱欲: 10 },
    竞赛属性: { 速度: 109, 耐力: 109, 力量: 102, 毅力: 112, 智慧: 118 },
    适性: {
        草地: 'A', 沙地: 'G',
        短距离: 'F', 英里: 'E', 中距离: 'A', 长距离: 'B',
        领头: 'D', 前列: 'A', 居中: 'C', 后追: 'E'
    },
    称呼列表: [
        { 判别式: '', 称呼: '训练员' }
    ]
  },
  '摩耶重炮': {
    id: '摩耶重炮',
    名称: '摩耶重炮',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '天才', '冒失', '幸运', '恋爱脑', '小祖宗'],
    通用属性: { 体质: 16, 学识: 10, 魅力: 16, 财富: 10, 心情: 70, 体力: 90, 精力: 70, 爱欲: 15 },
    竞赛属性: { 速度: 94, 耐力: 130, 力量: 86, 毅力: 123, 智慧: 117 },
    适性: {
        草地: 'A', 沙地: 'E',
        短距离: 'D', 英里: 'D', 中距离: 'A', 长距离: 'A',
        领头: 'A', 前列: 'A', 居中: 'B', 后追: 'B'
    },
    称呼列表: [
        { 判别式: '', 称呼: '训练员' }
    ]
  },
  '米浴': {
    id: '米浴',
    名称: '米浴',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '倒霉', '沉重', '凡人', '小祖宗'], 
    通用属性: { 体质: 6, 学识: 14, 魅力: 10, 财富: 10, 心情: 40, 体力: 80, 精力: 90, 爱欲: 10 },
    竞赛属性: { 速度: 87, 耐力: 143, 力量: 86, 毅力: 125, 智慧: 109 },
    适性: {
        草地: 'A', 沙地: 'G',
        短距离: 'E', 英里: 'C', 中距离: 'A', 长距离: 'A',
        领头: 'B', 前列: 'A', 居中: 'C', 后追: 'G'
    },
    称呼列表: [
        { 判别式: '训练员.性别 == "男"', 称呼: '大哥哥' },
        { 判别式: '训练员.性别 == "女"', 称呼: '大姐姐' },
        { 判别式: '', 称呼: '训练员' }
    ]
  },
  '北部玄驹': {
    id: '北部玄驹',
    名称: '北部玄驹',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '热血', '乐于助人', '大小姐', '歌手'],
    通用属性: { 体质: 18, 学识: 12, 魅力: 18, 财富: 20, 心情: 90, 体力: 100, 精力: 90, 爱欲: 10 },
    竞赛属性: { 速度: 119, 耐力: 122, 力量: 97, 毅力: 105, 智慧: 107 },
    适性: {
        草地: 'A', 沙地: 'G',
        短距离: 'E', 英里: 'C', 中距离: 'A', 长距离: 'A',
        领头: 'A', 前列: 'B', 居中: 'C', 后追: 'G'
    },
    称呼列表: [
        { 判别式: '训练员.性别 == "男"', 称呼: '训练员先生' },
        { 判别式: '训练员.性别 == "女"', 称呼: '训练员' },
    ]
  },
  '无声铃鹿': {
    id: '无声铃鹿',
    名称: '无声铃鹿',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '木头'],
    通用属性: { 体质: 8, 学识: 12, 魅力: 15, 财富: 10, 心情: 60, 体力: 90, 精力: 90, 爱欲: 0 },
    竞赛属性: { 速度: 124, 耐力: 102, 力量: 94, 毅力: 122, 智慧: 108 },
    适性: {
        草地: 'A', 沙地: 'G',
        短距离: 'D', 英里: 'A', 中距离: 'A', 长距离: 'E',
        领头: 'A', 前列: 'C', 居中: 'E', 后追: 'G'
    },
    称呼列表: [
        { 判别式: '训练员.性别 == "男"', 称呼: '训练员先生' },
        { 判别式: '训练员.性别 == "女"', 称呼: '训练员小姐' },
    ]
  },
  '骏川手纲': {
    id: '骏川手纲',
    名称: '骏川手纲',
    性别: '女',
    isTrainer: false, // NPC/Support
    初始标签: ['马娘', '天才', '老成'],
    通用属性: { 体质: 20, 学识: 20, 魅力: 20, 财富: 15, 心情: 100, 体力: 100, 精力: 100, 爱欲: 10 },
    竞赛属性: { 速度: 864, 耐力: 510, 力量: 510, 毅力: 600, 智慧: 516 },
    适性: {
        草地: 'A', 沙地: 'G',
        短距离: 'D', 英里: 'C', 中距离: 'B', 长距离: 'A',
        领头: 'A', 前列: 'F', 居中: 'G', 后追: 'G'
    },
    称呼列表: [
        { 判别式: '训练员.性别 == "男"', 称呼: '训练员先生' },
        { 判别式: '训练员.性别 == "女"', 称呼: '训练员小姐' },
    ]
  }
};
