import { CharacterTemplate } from '../types';

// ===========================
// 角色配置 (Characters)
// ===========================
export const CHARACTERS: Record<string, CharacterTemplate> = {
  'player_template': {
    id: 'player_template',
    名称: '训练员', 
    性别: '男', 
    isTrainer: true,
    初始标签: ['训练员'],
    // 基础属性翻倍，新增状态属性 (体力100, 精力100, 心情60, 爱欲10)
    通用属性: { 体质: 20, 学识: 20, 魅力: 20, 财富: 20, 心情: 60, 体力: 100, 精力: 100, 爱欲: 10 },
    竞赛属性: { 速度: 0, 耐力: 0, 力量: 0, 毅力: 0, 智慧: 0 }
  },
  'nice_nature': {
    id: 'nice_nature',
    名称: '优秀素质',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '配角', '凡人', '贫穷', '冷静', '吐槽役'],
    通用属性: { 体质: 12, 学识: 14, 魅力: 12, 财富: 6, 心情: 50, 体力: 80, 精力: 80, 爱欲: 20 },
    竞赛属性: { 速度: 108, 耐力: 99, 力量: 113, 毅力: 100, 智慧: 114 },
    称呼列表: [
        { 判别式: '', 称呼: '训练员' } // 默认
    ]
  },
  'tokai_teio': {
    id: 'tokai_teio',
    名称: '东海帝王',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '天才', '热血', '魅力十足', '小鸟胃'],
    通用属性: { 体质: 8, 学识: 12, 魅力: 20, 财富: 12, 心情: 80, 体力: 90, 精力: 90, 爱欲: 10 },
    竞赛属性: { 速度: 125, 耐力: 100, 力量: 105, 毅力: 120, 智慧: 110 },
    称呼列表: [
        { 判别式: '训练员.性别 == "男"', 称呼: '欧尼酱' },
        { 判别式: '训练员.性别 == "女"', 称呼: '姐姐大人' },
        { 判别式: '', 称呼: '训练员' }
    ]
  },
  'mayano_top_gun': {
    id: 'mayano_top_gun',
    名称: '摩耶重炮',
    性别: '女',
    isTrainer: false,
    初始标签: ['马娘', '在役', '天才', '冒失', '幸运', '大胃王'],
    通用属性: { 体质: 16, 学识: 10, 魅力: 16, 财富: 10, 心情: 70, 体力: 90, 精力: 70, 爱欲: 15 },
    竞赛属性: { 速度: 115, 耐力: 110, 力量: 110, 毅力: 90, 智慧: 125 },
    称呼列表: [
        { 判别式: '训练员.性别 == "男"', 称呼: '大哥哥' },
        { 判别式: '训练员.性别 == "女"', 称呼: '大姐姐' },
        { 判别式: '', 称呼: 'Training苏~' }
    ]
  }
};